Config/Catalogs/HotelProducts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>HotelProducts</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomQuota</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomQuotas</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FixedClient</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckInDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckOutDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FixProductPeriod</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FixPlannedPeriod</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FixProductCost</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DurationCalculationRuleType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DurationCalculationRuleTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReferenceHour</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Service</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentSection</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentSections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SocialGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SocialGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseVaucherTypeCodeAsVaucherSeries</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SeriesSplitter</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SeriesIsAtTheEnd</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OpenNewProductForm</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletionMarkDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletionMarkAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/DurationCalculationRuleTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>DurationCalculationRuleTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ByReferenceHour</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ByDays</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ByNights</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ByHours</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/Folio.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Folio</Name>
			<BasedOn>
				<xr:Item>Catalog.ObjectTemplates</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClosed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClosedAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClosedDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FolioCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentDoc</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Accommodation</v8:Type>
						<v8:Type>cfg:DocumentRef.Reservation</v8:Type>
						<v8:Type>cfg:DocumentRef.ResourceReservation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Agent</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Contracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuestGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GuestGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FinancialAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccountsFO</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountCodeBO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateTimeFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateTimeTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentSection</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentSections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreditLimit</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsMaster</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotUpdateCompany</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotUpdateCustomer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotFillAgent</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HotelProduct</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HotelProducts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DebtDecision</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DebtsDecisionTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DebtDecisionAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DebtDecisionDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DebtDecisionRemarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FolioDiscountCard</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FolioDiscountType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LineNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsComplimentary</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsHouseUse</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsForDirectPostings</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsForExternalPOS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsArchived</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/HotelProducts/Ext/ObjectModule.bsl
#Region EventHandlers

// -----------------------------------------------------------------------------
Procedure OnCopy(pCopiedObject)
	// Clear product code and description
	If Not IsFolder Then
		Code = "";
		Description = "";
		ExternalCode = "";
		CreateDate = CurrentSessionDate();
		Author = SessionParameters.CurrentUser;
	EndIf;
EndProcedure // OnCopy

// -----------------------------------------------------------------------------
Procedure BeforeWrite(pCancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	If Not IsFolder Then
		// Deletion mark date and author
		If Not DeletionMark Then
			If ValueIsFilled(DeletionMarkDate) Then
				DeletionMarkDate = Undefined;
			EndIf;
			If ValueIsFilled(DeletionMarkAuthor) Then
				DeletionMarkAuthor = Catalogs.Employees.EmptyRef();
			EndIf;
		Else
			If Not ValueIsFilled(DeletionMarkDate) Then
				DeletionMarkDate = CurrentSessionDate();
			EndIf;
			If Not ValueIsFilled(DeletionMarkAuthor) Then
				DeletionMarkAuthor = SessionParameters.CurrentUser;
			EndIf;
		EndIf;
		// Create date
		If Not ValueIsFilled(CreateDate) Then
			CreateDate = CurrentSessionDate();
			Author = SessionParameters.CurrentUser;
		EndIf;
		// Payment date
		If Not ValueIsFilled(PaymentDate) Then
			vPaymentMethod = Undefined;
			PaymentDate = pmGetHotelProductPaymentDate(vPaymentMethod);
			If ValueIsFilled(vPaymentMethod) Then
				PaymentMethod = vPaymentMethod;
			EndIf;
		EndIf;
		// Client
		If Not FixedClient Then
			vClient = pmGetHotelProductClient();
			If ValueIsFilled(vClient) And vClient <> Client Then
				Client = vClient;
			EndIf;
		EndIf;
	Else
		If DeletionMark Then
			// Check user rights to edit form
			If Not cmCheckUserPermissions("HavePermissionToManagePrices") Then
				pCancel = True;
			EndIf;
		EndIf;
	EndIf;
EndProcedure // BeforeWrite

// --------------------------------------------------------------------------------
Procedure OnWrite(pCancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure // OnWrite

#EndRegion  

#Region Public

// -----------------------------------------------------------------------------
Procedure pmFillAttributesWithDefaultValues() Export
	If Not ValueIsFilled(Hotel) Then
		If ValueIsFilled(RoomQuota) Then
			Hotel = RoomQuota.Hotel;
		Else
			Hotel = SessionParameters.CurrentHotel;
		EndIf;
	EndIf;
	If Not ValueIsFilled(Currency) Then
		If ValueIsFilled(Hotel) Then
			Currency = Hotel.FolioCurrency;
		EndIf;
	EndIf;
	If Not IsFolder Then
		If Not ValueIsFilled(CreateDate) Then
			CreateDate = CurrentSessionDate();
			Author = SessionParameters.CurrentUser;
		EndIf;
	EndIf;
EndProcedure // pmFillAttributesWithDefaultValues

// -----------------------------------------------------------------------------
Function pmGetDefaultDescription() Export
	vDescription = ?(ValueIsFilled(RoomQuota), TrimAll(RoomQuota.Code) + " - ", "") 
					+ ?(ValueIsFilled(RoomType), TrimAll(RoomType.Code) + " ", "") 
					+ Format(CheckInDate, "DF='dd.MM.yy HH:mm'") + " - " 
					+ Format(CheckOutDate, "DF='dd.MM.yy HH:mm'");
	Return vDescription;
EndFunction // pmGetDefaultDescription

// -----------------------------------------------------------------------------
Function pmGetDefaultCode() Export
	vCode = ?(ValueIsFilled(RoomQuota), TrimAll(RoomQuota.Code) + "-", "") 
			+ ?(ValueIsFilled(RoomType), TrimAll(RoomType.Code) + "-", "") 
			+ Format(Year(CheckInDate) * 1000 + DayOfYear(CheckInDate), "ND=7; NFD=0; NZ=; NG=");
	Return vCode;
EndFunction // pmGetDefaultCode

// -----------------------------------------------------------------------------
Function pmCheckHotelProductAttributes(pMessage, pAttributeInErr) Export
	vHasErrors = False;
	pMessage = "";
	pAttributeInErr = "";
	vMsgTextRu = "";
	vMsgTextEn = "";
	If IsBlankString(Code) Then
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Код> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Code> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Code", pAttributeInErr);
	EndIf;
	If IsBlankString(Description) Then
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Наименование> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Description> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Description", pAttributeInErr);
	EndIf;
	If Not ValueIsFilled(Hotel) Then
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Гостиница> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Hotel> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Hotel", pAttributeInErr);
	EndIf;
	If ValueIsFilled(CheckInDate) And ValueIsFilled(CheckOutDate) And
	   CheckOutDate <= CheckInDate Then
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Дата выезда> должен быть позже даты заезда!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Check-out date> attribute should be filled and after check-in date!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "CheckOutDate", pAttributeInErr);
	EndIf;
	If vHasErrors Then
		pMessage = "ru = '" + TrimAll(vMsgTextRu) + "';" + "en = '" + TrimAll(vMsgTextEn) + "';";
	EndIf;
	Return vHasErrors;
EndFunction // pmCheckHotelProductAttributes

// -----------------------------------------------------------------------------
// Calculates and returns duration for giving check in and check out dates
// -----------------------------------------------------------------------------
Function pmCalculateDuration() Export
	vDuration = 0;
	If ValueIsFilled(CheckInDate) And
	   ValueIsFilled(CheckOutDate) Then
		vReferenceHour = 0;
		vDurationCalculationRuleType = Undefined;
		vPeriodInHours = 24;   
		vOneHour = 3600;
		If ValueIsFilled(Parent) Then
			vDurationCalculationRuleType = Parent.DurationCalculationRuleType;
			vReferenceHour = Parent.ReferenceHour - BegOfDay(Parent.ReferenceHour);
		EndIf;
		If vDurationCalculationRuleType = Enums.DurationCalculationRuleTypes.ByReferenceHour And 
		   vReferenceHour = 0 Then
			vPerInSec = EndOfDay(CheckOutDate) - BegOfDay(CheckInDate);
			vDuration = Round(vPerInSec / vPeriodInHours / vOneHour, 0);
		ElsIf vDurationCalculationRuleType = Enums.DurationCalculationRuleTypes.ByReferenceHour Then
			vPerInSec = (BegOfDay(CheckOutDate) + vReferenceHour) - (BegOfDay(CheckInDate) + vReferenceHour);
			vDuration = Round(vPerInSec / vPeriodInHours / vOneHour, 0);
		ElsIf vDurationCalculationRuleType = Enums.DurationCalculationRuleTypes.ByDays Then
			vPerInSec = EndOfDay(CheckOutDate) - BegOfDay(CheckInDate);
			vDuration = Round(vPerInSec / vPeriodInHours / vOneHour, 0);
		ElsIf vDurationCalculationRuleType = Enums.DurationCalculationRuleTypes.ByNights Then
			vPerInSec = CheckOutDate - CheckInDate;
			vDuration = Round(vPerInSec / vPeriodInHours / vOneHour, 0);
		Else
			vPerInSec = CheckOutDate - CheckInDate;
			vDuration = Round(vPerInSec  /vPeriodInHours / vOneHour, 0);
		EndIf;
	EndIf;
	Return vDuration;
EndFunction // pmCalculateDuration

// -----------------------------------------------------------------------------
// Calculates and returns check out date based on giving duration and check in date
// -----------------------------------------------------------------------------
Function pmCalculateCheckOutDate() Export
	vCheckOutDate = CheckOutDate;
	If ValueIsFilled(CheckInDate) And Duration > 0 Then
		vReferenceHour = 0;
		vDurationCalculationRuleType = Undefined;
		vPeriodInHours = 24;  
		vOneHour = 3600;
		If ValueIsFilled(Parent) Then
			vDurationCalculationRuleType = Parent.DurationCalculationRuleType;
			vReferenceHour = Parent.ReferenceHour - BegOfDay(Parent.ReferenceHour);
		EndIf;
		If vDurationCalculationRuleType = Enums.DurationCalculationRuleTypes.ByReferenceHour Then
			If vReferenceHour = 0 Then
				vCheckOutDate = BegOfDay(CheckInDate) + vReferenceHour + Duration * vPeriodInHours * vOneHour - 1;
			Else
				vCheckOutDate = BegOfDay(CheckInDate) + vReferenceHour + Duration * vPeriodInHours * vOneHour;
			EndIf;
		ElsIf vDurationCalculationRuleType = Enums.DurationCalculationRuleTypes.ByDays Then
			vCheckOutDate = BegOfDay(CheckInDate) + Duration * vPeriodInHours * vOneHour - 3 * vOneHour;
		ElsIf vDurationCalculationRuleType = Enums.DurationCalculationRuleTypes.ByNights Then
			vCheckInTime = CheckInDate - BegOfDay(CheckInDate);
			If vCheckInTime <= 9 * vOneHour Then // Breakfast check-in
				vCheckOutDate = BegOfDay(CheckInDate) + Duration * vPeriodInHours * vOneHour + 7 * vOneHour;
			ElsIf vCheckInTime <= 14 * vOneHour Then // Lunch check-in
				vCheckOutDate = BegOfDay(CheckInDate) + Duration * vPeriodInHours * vOneHour + 12 * vOneHour;
			ElsIf vCheckInTime <= 20 * vOneHour Then // Supper check-in
				vCheckOutDate = BegOfDay(CheckInDate) + Duration * vPeriodInHours * vOneHour + 18 * vOneHour;
			Else  // Late check-in
				vCheckOutDate = BegOfDay(CheckInDate) + Duration * vPeriodInHours * vOneHour + 21 * vOneHour;
			EndIf;
		Else
			vCheckOutDate = cm0SecondShift(CheckInDate + Duration * vPeriodInHours * vOneHour);
		EndIf;
	EndIf;
	Return vCheckOutDate;
EndFunction // pmCalculateDateTo

// -----------------------------------------------------------------------------
Function pmGetHotelProductDocuments() Export
	vQry = New Query();
	vQry.Text = 
	"SELECT
	|	Accommodation.Ref AS Document,
	|	Accommodation.Customer AS Customer,
	|	Accommodation.Contract AS Contract,
	|	Accommodation.GuestGroup AS GuestGroup,
	|	Accommodation.CheckInDate AS CheckInDate,
	|	Accommodation.Duration AS Duration,
	|	Accommodation.CheckOutDate AS CheckOutDate,
	|	Accommodation.RoomType AS RoomType,
	|	Accommodation.Room AS Room,
	|	Accommodation.Guest AS Guest,
	|	Accommodation.PointInTime AS PointInTime,
	|	4 AS Priority
	|FROM
	|	Document.Accommodation AS Accommodation
	|WHERE
	|	Accommodation.Posted
	|	AND Accommodation.AccommodationStatus.IsActive
	|	AND Accommodation.HotelProduct = &qHotelProduct
	|
	|UNION ALL
	|
	|SELECT
	|	Folio.Ref,
	|	Folio.Customer,
	|	Folio.Contract,
	|	Folio.GuestGroup,
	|	Folio.DateTimeFrom,
	|	0,
	|	Folio.DateTimeTo,
	|	Folio.Room.RoomType,
	|	Folio.Room,
	|	Folio.Client,
	|	Folio.PointInTime,
	|	3
	|FROM
	|	Document.Folio AS Folio
	|WHERE
	|	Folio.HotelProduct = &qHotelProduct
	|
	|UNION ALL
	|
	|SELECT
	|	Reservation.Ref,
	|	Reservation.Customer,
	|	Reservation.Contract,
	|	Reservation.GuestGroup,
	|	Reservation.CheckInDate,
	|	Reservation.Duration,
	|	Reservation.CheckOutDate,
	|	Reservation.RoomType,
	|	Reservation.Room,
	|	Reservation.Guest,
	|	Reservation.PointInTime,
	|	2
	|FROM
	|	Document.Reservation AS Reservation
	|WHERE
	|	Reservation.Posted
	|	AND Reservation.HotelProduct = &qHotelProduct
	|	AND Reservation.ReservationStatus.IsActive
	|
	|UNION ALL
	|
	|SELECT
	|	Charge.Folio,
	|	Charge.Folio.Customer,
	|	Charge.Folio.Contract,
	|	Charge.Folio.GuestGroup,
	|	Charge.Folio.DateTimeFrom,
	|	0,
	|	Charge.Folio.DateTimeTo,
	|	Charge.Folio.Room.RoomType,
	|	Charge.Folio.Room,
	|	Charge.Folio.Client,
	|	Charge.PointInTime,
	|	1
	|FROM
	|	Document.Charge AS Charge
	|WHERE
	|	Charge.Posted
	|	AND Charge.HotelProduct = &qHotelProduct
	|	AND Charge.IsAdditional
	|
	|ORDER BY
	|	Priority,
	|	PointInTime";
	vQry.SetParameter("qHotelProduct", Ref);
	Return vQry.Execute().Unload();
EndFunction // pmGetHotelProductDocuments

// -----------------------------------------------------------------------------
Function pmGetHotelProductAmount() Export
	vAmount = 0;
	vQry = New Query();
	vQry.Text = 
	"SELECT
	|	SalesTurnovers.HotelProduct AS HotelProduct,
	|	SUM(SalesTurnovers.Amount) AS Amount
	|FROM
	|	(SELECT
	|		HotelProductSalesTurnovers.HotelProduct AS HotelProduct,
	|		HotelProductSalesTurnovers.SalesTurnover AS Amount
	|	FROM
	|		AccumulationRegister.HotelProductSales.Turnovers(, , Period, HotelProduct = &qHotelProduct) AS HotelProductSalesTurnovers
	|	
	|	UNION ALL
	|	
	|	SELECT
	|		SalesForecastTurnovers.HotelProduct,
	|		SalesForecastTurnovers.SalesTurnover
	|	FROM
	|		AccumulationRegister.SalesForecast.Turnovers(&qForecastPeriodFrom, &qForecastPeriodTo, Period, HotelProduct = &qHotelProduct) AS SalesForecastTurnovers) AS SalesTurnovers
	|
	|GROUP BY
	|	SalesTurnovers.HotelProduct";
	vQry.SetParameter("qHotelProduct", Ref);
	vQry.SetParameter("qForecastPeriodFrom", tcOnServer.GetForecastStartDate(Hotel));
	vQry.SetParameter("qForecastPeriodTo", '39991231235959');
	vRes = vQry.Execute().Unload();
	For Each vResRow In vRes Do
		vAmount = vAmount + vResRow.Amount;
	EndDo;
	Return vAmount;
EndFunction // pmGetHotelProductAmount

// -----------------------------------------------------------------------------
Function pmGetHotelProductClient() Export
	vClient = 0;
	vQry = New Query();
	vQry.Text = 
	"SELECT
	|	HotelProductSalesTurnovers.HotelProduct AS HotelProduct,
	|	HotelProductSalesTurnovers.Client AS Client,
	|	HotelProductSalesTurnovers.SalesTurnover AS Amount
	|FROM
	|	AccumulationRegister.HotelProductSales.Turnovers(, , Period, HotelProduct = &qHotelProduct) AS HotelProductSalesTurnovers
	|
	|ORDER BY
	|	Amount DESC";
	vQry.SetParameter("qHotelProduct", Ref);
	vRes = vQry.Execute().Unload();
	For Each vResRow In vRes Do
		If ValueIsFilled(vResRow.Client) Then
			vClient = vResRow.Client;
		EndIf;
	EndDo;
	Return vClient;
EndFunction // pmGetHotelProductClient

// -----------------------------------------------------------------------------
Function pmGetHotelProductPaymentDate(rPaymentMethod) Export
	vPaymentDate = '00010101';
	rPaymentMethod = Undefined;
	vQry = New Query();
	vQry.Text = 
	"SELECT DISTINCT
	|	CASE
	|		WHEN HotelProductSales.Recorder.Folio IS NULL
	|			THEN HotelProductSales.Recorder.ParentCharge.Folio
	|		ELSE HotelProductSales.Recorder.Folio
	|	END AS Folio
	|INTO HotelProductFolios
	|FROM
	|	AccumulationRegister.HotelProductSales AS HotelProductSales
	|WHERE
	|	HotelProductSales.HotelProduct = &qHotelProduct
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT DISTINCT
	|	DepositTransfers.FolioFrom AS Folio
	|INTO TransferFolios
	|FROM
	|	Document.DepositTransfer AS DepositTransfers
	|WHERE
	|	DepositTransfers.Posted
	|	AND DepositTransfers.FolioTo IN
	|			(SELECT
	|				HotelProductFolios.Folio
	|			FROM
	|				HotelProductFolios AS HotelProductFolios)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	HotelProductFolios.Folio AS Folio
	|INTO BoundFolios
	|FROM
	|	HotelProductFolios AS HotelProductFolios
	|
	|UNION ALL
	|
	|SELECT
	|	TransferFolios.Folio
	|FROM
	|	TransferFolios AS TransferFolios
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Payments.Date AS PaymentDate,
	|	Payments.PaymentMethod AS PaymentMethod
	|FROM
	|	Document.Payment AS Payments
	|WHERE
	|	Payments.Posted
	|	AND Payments.Folio IN
	|			(SELECT
	|				BoundFolios.Folio
	|			FROM
	|				BoundFolios AS BoundFolios)
	|
	|ORDER BY
	|	PaymentDate DESC";
	vQry.SetParameter("qHotelProduct", Ref);
	vRes = vQry.Execute().Unload();
	For Each vResRow In vRes Do
		vPaymentDate = vResRow.PaymentDate;
		rPaymentMethod = vResRow.PaymentMethod;
		Break;
	EndDo;
	Return vPaymentDate;
EndFunction // pmGetHotelProductPaymentDate

#EndRegion
